app/controllers/api/v1/memes_controller.rb

      def index
    render json: Meme.all
---
SELECT "memes".* FROM "memes"

  def create
    # meme = Meme.generate_meme(params)
  meme = Meme.generate_meme(template_id: params[:template_id], username: "kasiarosenb", password: "kasiarosenb", text0: params[:text0], text1: params[:text1])

  new_meme = Meme.create(url: meme["url"], page_url: meme["page_url"])
---
INSERT INTO "memes" ("url", "page_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "http://i.imgflip.com/2dr7ld.jpg"], ["page_url", "https://imgflip.com/i/2dr7ld"], ["created_at", "2018-07-10 19:23:10.793516"], ["updated_at", "2018-07-10 19:23:10.793516"]]